00test/oldtest/Laser_3D_buse_turb/constant/LaserProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      PhaseFieldProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
V_incident	(1 0 0);//(0 1 0);//NORMALISED IN CODE

// Laser initial position (x, y, z) in meters
laserInitialPosition (0.000 0.0 0.0);

// Laser scanning velocity (m/s)
laserVelocity (0.0 0.0 0.0);

// Laser beam radius (m)
HS_a 0.0007;

// Laser power (W)
HS_Q 250.0;

// Gaussian distribution factor k: I = (k*Q)/(pi*a^2) * exp(-k*r^2/a^2)
// k=2: TEM00 mode (standard Gaussian beam)
// k=1: Simple Gaussian (wider distribution)
gaussianK 2.0;

// Legacy parameters (for LaserHS.H compatibility)
HS_bg 0.0;
HS_velocity 0.0;
HS_lg 0e-3;

// ============ Laser Attenuation Parameters ============
// Enable/disable laser attenuation due to particles
enableAttenuation true;

// Extinction efficiency factor Qext (dimensionless)
// Typical values: 1.5-3.0 for metallic particles at laser wavelength
// Qext = Qabs + Qsca (absorption + scattering)
// For small particles (d << λ): Qext ~ 2-3
// For large particles (d >> λ): Qext ~ 2 (geometric optics limit)
extinctionEfficiency 2.0;
